sample/silicaParticleMelting/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format    ascii;

    class     dictionary;

    location  "system";

    object    controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver             multicomponentFluid;

startFrom          startTime;

startTime          0;

stopAt             endTime;

endTime            5.000000e-02;

deltaT             1.000000e-06;

writeControl       adjustableRunTime;

writeInterval      5.000000e-04;

purgeWrite         0;

writeFormat        ascii;

writePrecision     10;

writeCompression   false;

timeFormat         scientific;

timePrecision      6;

runTimeModifiable  true;

adjustTimeStep     true;

maxCo              1;

maxDeltaT          1.000000e-04;

libs
(
    "libextendedThermophysicalProperties.so"
    "libextendedLagrangianParcel.so"
);

// ************************************************************************* //