sample/silicaParticleMelting/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format  ascii;

    class   dictionary;

    object  blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters  1;

vertices
(
    (0.000 0.000 0.000)
    (0.003 0.000 0.000)
    (0.003 0.003 0.000)
    (0.000 0.003 0.000)
    (0.000 0.000 0.003)
    (0.003 0.000 0.003)
    (0.003 0.003 0.003)
    (0.000 0.003 0.003)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (7 7 7) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (0 4 7 3)
            (1 5 4 0)
            (2 6 5 1)
            (3 7 6 2)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //