sample/silicaParticleMelting/constant/data/cp
( 200.00    733.3)
( 220.00    708.0)
( 240.00    703.7)
( 260.00    713.1)
( 280.00    730.5)
( 298.15    741.9)
( 300.00    755.9)
( 320.00    783.7)
( 340.00    813.4)
( 360.00    843.7)
( 380.00    873.7)
( 400.00    902.8)
( 420.00    930.3)
( 440.00    955.8)
( 460.00    979.1)
( 480.00    999.8)
( 500.00   1017.8)
( 520.00   1032.8)
( 540.00   1046.6)
( 560.00   1059.1)
( 580.00   1069.5)
( 600.00   1078.8)
( 620.00   1088.3)
( 640.00   1098.6)
( 660.00   1110.6)
( 680.00   1124.9)
( 700.00   1142.1)
( 720.00   1162.6)
( 740.00   1186.8)
( 760.00   1215.6)
( 780.00   1251.2)
( 800.00   1294.2)
( 820.00   1345.6)
( 840.00   1569.9)
( 860.00   1126.1)
( 880.00   1129.4)
( 900.00   1132.6)
( 920.00   1135.9)
( 940.00   1139.2)
( 960.00   1142.5)
( 980.00   1145.8)
(1000.00   1149.1)
(1020.00   1152.4)
(1040.00   1155.7)
(1060.00   1159.1)
(1080.00   1162.4)
(1100.00   1165.7)
(1120.00   1169.1)
(1140.00   3048.3)
(1159.00   2436.8)
(1160.00   1164.2)
(1180.00   1165.2)
(1200.00   1166.3)
(1220.00   1167.4)
(1240.00   1168.5)
(1260.00   1169.8)
(1280.00   1171.1)
(1300.00   1172.5)
(1320.00   1174.0)
(1340.00   1175.6)
(1360.00   1177.4)
(1380.00   1179.3)
(1400.00   1181.3)
(1420.00   1183.6)
(1440.00   1185.9)
(1460.00   1188.5)
(1480.00   1191.3)
(1500.00   1194.2)
(1520.00   1197.3)
(1540.00   1200.6)
(1560.00   1204.2)
(1580.00   1207.9)
(1600.00   1211.9)
(1620.00   1216.0)
(1640.00   1220.4)
(1660.00   1223.8)
(1680.00   1226.4)
(1700.00   1228.2)
(1720.00   1694.8)
(1740.00   1500.6)
(1741.00   1217.5)
(1760.00   1233.4)
(1780.00   1235.2)
(1800.00   1237.0)
(1820.00   1238.9)
(1840.00   1240.7)
(1860.00   1242.6)
(1880.00   1244.5)
(1900.00   1246.4)
(1920.00   1248.4)
(1940.00   1250.4)
(1960.00   1252.4)
(1980.00   8823.5)
(1999.00   6435.8)
(2000.00   1392.3)
(2020.00   1394.9)
(2040.00   1397.5)
(2060.00   1400.0)
(2080.00   1402.5)
(2100.00   1404.9)
(2120.00   1407.2)
(2140.00   1409.5)
(2160.00   1411.7)
(2180.00   1413.9)
(2200.00   1416.0)
(2220.00   1418.1)
(2240.00   1420.1)
(2260.00   1422.0)
(2280.00   1423.9)
(2300.00   1425.7)
(2320.00   1427.5)
(2340.00   1429.2)
(2360.00   1430.9)
(2380.00   1432.5)
(2400.00   1434.1)
(2420.00   1435.6)
(2440.00   1437.0)
(2460.00   1438.4)
(2480.00   1439.7)
(2500.00   1441.0)
(2520.00   1442.2)
(2540.00   1443.4)
(2560.00   1444.5)
(2580.00   1445.6)
(2600.00   1446.6)
(2620.00   1447.5)
(2640.00   1448.4)
(2660.00   1449.2)
(2680.00   1450.0)
(2700.00   1450.7)
(2720.00   1451.4)
(2740.00   1452.0)
(2760.00   1452.6)
(2780.00   1453.1)
(2800.00   1453.5)
(2820.00   1453.9)
(2840.00   1454.2)
(2860.00   1454.5)
(2880.00   1454.7)
(2900.00   1454.9)
(2920.00   1455.0)
(2940.00   1455.1)
(2960.00   1455.1)
(2980.00   1455.1)
