sample/silicaParticleMelting/constant/data/kappa
( 300  1.5)
(3500  1.5)