sample/silicaParticleMelting/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format    ascii;

    class     volScalarField;

    location  "0";

    object    p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [1 -1 -2 0 0 0 0];

internalField  uniform 101325;

boundaryField
{
    walls
    {
        type  fixedFluxPressure;
    }
}

// ************************************************************************* //